In [1]:
import pandas as pd

In [4]:
#DataFrame을 새로 생성 (name, english, math의 3개의 컬럼으로 구성)
df1 = pd.DataFrame({
     'name' : ['김기훈', '이유진', '박동현', '김민지'],
     'english' : [90, 80, 60, 70],
     'math' : [50, 60 , 100, 20]
 })
# 생헝한 Data Frame df1을 출력
df1

  name  english  math
0  김기훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [27]:
# Data Frame df1의 index 값 확인
df1.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
# Data Frame df1의 컬럼(변수) 값 확인
df1.columns

Index(['name', 'english', 'math'], dtype='object')

In [9]:
# Data Frame df1의 값을 확인 (numpy의 array)로 출력
df1.values

array([['김기훈', 90, 50],
       ['이유진', 80, 60],
       ['박동현', 60, 100],
       ['김민지', 70, 20]], dtype=object)

In [13]:
# 컬럼 math 추출 (시리즈)
s1 = df1['math']
s1

0     50
1     60
2    100
3     20
Name: math, dtype: int64

In [14]:
# df1에서 컬럼 math의 합 계산 
sum(df1['math'])

230

In [15]:
# df1에서 컬럼 english의 평균 값 계산 
sum(df1['english']) / 4

75.0

In [17]:
# df1에서 컬럼 math의 합 계산 
df1['math'].sum()

230

In [18]:
# df1에서 컬럼 math의 평균 값 계산 
df1['math'].sum() /4

57.5

In [20]:
# df1에서 컬럼 math의 평균 값 계산 
df1['math'].sum()/df1['math'].count()

57.5

In [21]:
# df1에서 컬럼 math의 평균 값 계산 
df1['math'].mean()

57.5

In [23]:
# 컬럼 math 추출
s1 = df1[['math']]
s1

   math
0    50
1    60
2   100
3    20

In [24]:
# df1에서 컬럼 english, math 추출 (Data Frame) 
df1 [ ['english', 'math'] ]

   english  math
0       90    50
1       80    60
2       60   100
3       70    20

In [25]:
df1 [ ['english', 'math'] ] > 70

   english   math
0     True  False
1     True  False
2    False   True
3    False  False

In [26]:
# data Frame pd_em에서 컬럼 (english, marh) 별 합 계산 
# Python에서는 True는 1 false는 0 
pd_em =df1[['english','math']] > 70
pd_em.sum()

english    2
math       1
dtype: int64

In [34]:
# Data Frame 생성 (컬럼 이름과 인덱스 이름을 명시적으로 지정)
df2 = pd.DataFrame(
    [[90, 50], [80, 60], [60, 100], [70, 20]],
    columns = ['english', 'math'],
    index = ['김기훈', '이유진','박동현','김민지'])
df2

     english  math
김기훈       90    50
이유진       80    60
박동현       60   100
김민지       70    20

In [35]:
# df2의 index 값 출력 
df2.index

Index(['김기훈', '이유진', '박동현', '김민지'], dtype='object')

In [36]:
# df2의 컬럼 값 출력 
df2.columns

Index(['english', 'math'], dtype='object')

In [37]:
# df2의 데이터 값 출력 (array)
df2.values

array([[ 90,  50],
       [ 80,  60],
       [ 60, 100],
       [ 70,  20]], dtype=int64)

In [38]:
# df2의 컬럼 math의 평균 구하기 
df2['math'].mean()

57.5

In [39]:
# df2의 컬럼별 값이 50이상 여부 확인 (True, False)
df2 > 50

     english   math
김기훈     True  False
이유진     True   True
박동현     True   True
김민지     True  False

In [40]:
# True : 1 False : 0 
(df2 > 50).sum()

english    4
math       2
dtype: int64

In [45]:
df3 = pd.DataFrame({
    '제품 ' : ['사과', '딸기', '수박'],
    '가격'  : [1800, 1500, 3000],
    '판매량' : [24, 38, 13]
})
df3

  제품     가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [46]:
# df3의 인덱스 구하기 
df3.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
# df3의 컬럼 구하기 
df3.columns

Index(['제품 ', '가격', '판매량'], dtype='object')

In [48]:
# df3의 value값 구하기 (array)
df3.values

array([['사과', 1800, 24],
       ['딸기', 1500, 38],
       ['수박', 3000, 13]], dtype=object)

In [50]:
df3['가격'].sum() /3

2100.0

In [51]:
sum(df3['가격']) / 3

2100.0

In [53]:
df3['판매량'].sum() / 3

25.0

In [56]:
df4 = pd.DataFrame ([[1800, 24], [1500, 38],[3000,13]],
                   columns = ['가격', '판매량'],
                   index = ['사과', '딸기', '수박'])
df4

      가격  판매량
사과  1800   24
딸기  1500   38
수박  3000   13

In [57]:
# excel 파일 'excel_exam.xlsx' 를 읽어들여 Data Frame df_exam으로 지정
df_exam = pd.read_excel('excel_exam.xlsx')

In [58]:
#Data Frame df_exam의 첫 5개의 행을 출력 
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [59]:
# excel 파일 'excel_exam.xlsx'를 읽어들여 Data Frame df_exam으로 저장
# 단 Data Frame의 index를 'id' 값으로 지정 
df_exam = pd.read_excel('excel_exam.xlsx').set_index('id')

In [60]:
df_exam.head()

    nclass  math  english  science
id
1        1    50       98       50
2        1    60       97       60
3        1    45       86       78
4        1    30       98       58
5        2    25       80       65